backend/billing/billing-api/src/test/resources/billing/invoice/invoicePaid3DSecure.json

{
  "account": null,
  "api_version": "2020-08-27",
  "created": 1600980735,
  "data": {
    "previous_attributes": null,
    "object": {
      "id": "in_1HV1PnI1ysvdCIIxV2jkINgr",
      "object": "invoice",
      "account_country": "SI",
      "account_name": "Insight",
      "amount_due": 1500,
      "amount_paid": 1500,
      "amount_remaining": 0,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "billing_reason": "subscription_create",
      "charge": "ch_1HV1QII1ysvdCIIxRcUdwHAA",
      "collection_method": "charge_automatically",
      "created": 1600980703,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_I5Bn4eYlhxsqbz",
      "customer_address": null,
      "customer_email": "ematej.snuderl@gmail.com",
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://pay.stripe.com/invoice/acct_1HRYgqI1ysvdCIIx/invst_I5BnZnSe4GhzTNRwzRoEdvb5GGDkXPy",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1HRYgqI1ysvdCIIx/invst_I5BnZnSe4GhzTNRwzRoEdvb5GGDkXPy/pdf",
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1HV1PnI1ysvdCIIxEehhlouV",
            "object": "line_item",
            "amount": 1500,
            "currency": "usd",
            "description": "1 ? Billing Guide: Premium Service (at $15.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "livemode": false,
            "metadata": {},
            "period": {
              "end": 1603572703,
              "start": 1600980703
            },
            "plan": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1HRjvtI1ysvdCIIxwuxy4FEI",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1600198517,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_I1bvMWginyIvlU",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_I5BnHjyEOZTJU7",
            "subscription_item": "si_I5BnHKPjmA2YKf",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1HV1PnI1ysvdCIIxV2jkINgr/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "6ED8CCF9-0344",
      "paid": true,
      "payment_intent": "pi_1HV1PnI1ysvdCIIxrBuGQ9sn",
      "period_end": 1600980703,
      "period_start": 1600980703,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1600980703,
        "marked_uncollectible_at": null,
        "paid_at": 1600980735,
        "voided_at": null
      },
      "subscription": "sub_I5BnHjyEOZTJU7",
      "subtotal": 1500,
      "tax": null,
      "total": 1500,
      "total_discount_amounts": [],
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": 1600980705
    }
  },
  "id": "evt_1HV1QKI1ysvdCIIxavYKKRUe",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 3,
  "request": {
    "id": null,
    "idempotency_key": "pi_1HV1PnI1ysvdCIIxrBuGQ9sn-src_1HV1PpI1ysvdCIIxzsTcTmQ0"
  },
  "type": "invoice.paid"
}
